/*! \page page1 Описание меню
    \tableofcontents

    \section sec1 Описание структур меню

    Корневые элементы меню имеют тип Page. Вот они:
    \code
    +------------+-------------+
    |  Название  | Название    |
    |  в коде    | пункта меню |
    +------------+-------------+
    | pDisplay   | ДИСПЛЕЙ     |
    | pChanA     | КАНАЛ 1     |
    | pChanB     | КАНАЛ 2     |
    | pTrig      | СИНХР       | 
    | pTime      | РАЗВЕРТКА   |
    | pCursors   | КУРСОРЫ     | 
    | pMemory    | ПАМЯТЬ      |
    | pMeasures  | ИЗМЕРЕНИЯ   |
    | pService   | СЕРВИС      |
    | mpHelp     | ПОМОЩЬ      |
    +------------+-------------+
    \endcode

    \section sec2 Принципы наименования структур меню
    \code
    +-------------+-------------+---------------------------------------------+
    | Приставка в | Тип         | Примечание                                  |
    | названии    | структуры   |                                             |
    +-------------+-------------+---------------------------------------------+
    | mb          | Button      |                                             |
    | mc          | Choice      |                                             |
    | mp          | Page        | Корневой элемент раздела меню               |
    | msp         | Page        | Все остальные страницы меню - "подстраницы" |
    | sb          | SmallButton |                                             |
    +-------------+-------------+---------------------------------------------+
    \endcode
    Далее идёт условное название структуры. Например, \b mcShow - структура Choice, обслуживающая пункт меню <b>КУРСОРЫ - Показывать</b>. 
    На слово "показывать" указывает Show, а "КУРСОРЫ" никак не обозначены в названии, потому что областью видимости данного экземпляра структуры 
    является модуль.

    \section sec3 Принципы наименования фунций меню
    \code
    Глагол
    +-----------+-------------+-------------------------------------------------------------------------------+
    | Глагол    | К чему      | Описание                                                                      |
    |           | применим    |                                                                               |
    +-----------+-------------+-------------------------------------------------------------------------------+
    | DrawSB    | SmallButton | Функция отрисовски структуры SmallButton                                      |
    | IsActive  | All         | Функция возвращает true, если элемент активен. Применимо ко всем элементам    |
    | OnChanged | Choice      | Функция вызывается при изменении настройки Choice                             |
    | OnPress   | Button      | Реакция на нажатие элемента типа Button                                       |
    | OnRotate  | Regulator   | Реакция на поворот ручки                                                      |
    +-----------+-------------+-------------------------------------------------------------------------------+
    \endcode
*/
