/*! \page page1 Задействованные аппаратные ресурсы

    \tableofcontents

    \section section1 TIM2 Отсчёт тиков и микросекунд

    \section section2 TIM3, TIM4, TIM5 Таймеры на события
    Таймер TIM3 настраивается на отсчёт тиков. Для хранения текущего времени используется 64-битное значение. Младшее слово которого равно содержимому 
    счётчика TIM3, а старшее увеличивается каждый раз при переполнении счётчика TIM3.

    \section section3 SPI3 Управление смещением/масштабом по вертикали, уровнем синхронизации

    \section section4 SPI4 Программирование входного АЦП

    \section section5 FMC Запись/чтение в ПЛИС и дисплей

    \section section6 ADC Чтение рандомизатора

    \section section7 DAC1 Звукоизлучатель

    \section section8 DAC2 Управление тестер-компонентом

    \section section9 Порты ввода/вывода

    \code
    +-----+------+----+-----------------+----------------------------------------------------------+
    | №   |      |    |                 |                                                          |
    |конт | порт | I/O|                 |                                                          |
    +-----+------+----+-----------------+----------------------------------------------------------+
    | 40  | PA4  |  O | DAC1            | Звукоизлучатель                                          |
    | 45  | PA5  |  O | DAC2            | Управляющее напряжение на тестер-компонент               |
    | 43  | PA7  |  I | PAN_0           | На панель                                                |
    | 101 | PA9  | IO | USB OTG FS VBUS |                                                          |
    | 103 | PA11 | IO | USB OTG VS DM   |                                                          |
    | 104 | PA12 | IO | USB OTG VS DP   |                                                          |
    | 70  | PB11 |  I | ADC3 EXTI11     | АЦП рандомизатора                                        |
    | 74  | PB13 | IO | USB OTG HS VBUS | не используется                                          |
    | 75  | PB14 | IO | USB OTG HS DM   |                                                          |
    | 76  | PB15 | IO | USB OTG HS DP   |                                                          |
    | 44  | PC4  |  I | PAN_1           | На панель                                                |
    | 99  | PC9  |  I | TESTER_STR      | строб-импульсы от тестер-компонента                      |
    | 111 | PC10 |  O | SPI3 SCK        |                                                          |
    | 113 | PC12 |  O | SPI3 MOSI       |                                                          |
    | 114 | PD0  | IO | FMC D2          |                                                          |
    | 115 | PD1  | IO | FMC D3          |                                                          |
    | 117 | PD3  | IO | SPI3 CS1        |                                                          |
    | 118 | PD4  |  O | FMC NOE         |                                                          |
    | 119 | PD5  |  O | FMC NWE         |                                                          |
    | 123 | PD7  |  O | FMC NE1         | CS_ALT1 Выбор ПЛИС для работы с FMC                      |
    | 77  | PD8  | IO | USART3 TX       |                                                          |
    | 78  | PD9  | IO | USART3 RX       |                                                          |
    | 79  | PD10 |  O | A1              | масштаб по вертикали                                     |
    | 80  | PD11 |  O | A2              | масштаб по вертикали                                     |
    | 81  | PD12 |  O | A3              | масштаб по вертикали                                     |
    | 82  | PD13 |  O | A4              | масштаб по вертикали                                     |
    | 85  | PD14 | IO | FMC D0          |                                                          |
    | 86  | PD16 | IO | FMC D1          |                                                          |
    | 58  | PE7  | IO | FMC D4          |                                                          |
    | 59  | PE8  | IO | FMC D5          |                                                          |
    | 60  | PE9  | IO | FMC D6          |                                                          |
    | 63  | PE10 | IO | FMC D7          |                                                          |
    | 64  | PE11 |  O | SPI4 CS         | Программирование входных АЦП                             |
    | 65  | PE12 |  O | SPI4 SCK        | Программирование входных АЦП                             |
    | 67  | PE14 |  O | SPI4 MOSI       | Программирование входных АЦП                             |
    | 10  | PF0  |  O | FMC A0          |                                                          |
    | 11  | PF1  |  O | FMC A1          |                                                          |
    | 12  | PF2  |  O | FMC A2          |                                                          |
    | 13  | PF3  |  O | FMC A3          |                                                          |
    | 14  | PF4  |  O | FMC A4          |                                                          |
    | 15  | PF5  |  O | FMC A5          |                                                          |
    | 22  | PF10 |  I | ADC3 IN8        | АЦП рандомизатора                                        |
    | 53  | PF13 |  O | TESTER_ON       | Включение тестер-компонента                              |
    | 54  | PF14 |  O | TESTER_PNP      | Управление полярностью                                   |
    | 55  | PF15 |  O | TESTER_U        | Управление напряжением                                   |
    | 56  | PG0  |  O | TESTER_I        | Управление током                                         |
    | 87  | PG2  |  O | LF1             | (не используется)                                        |
    | 88  | PG3  |  O | LF2             | (не используется)                                        |
    | 89  | PG4  |  O | A1S             | управление входом синхронизации                          |
    | 90  | PG5  |  O | A0S             | управление входом синхронизации                          |
    | 91  | PG6  |  O | LFS             | управление входом синхронизации                          |
    | 124 | PG9  |  O | FMC NE2         | (CS_ALT2) Выбор ПЛИС для работы по FMC (не используется) |
    | 125 | PG10 |  O | FMC NE3         | (CS_ALT3) Выбор ПЛИС для работы по FMC (не используется) |
    | 127 | PG12 |  O | FMC NE4         | Выбор панели для работы по параллельной шине             |
    | 128 | PG13 |  O | SPI3 CS2        |                                                          |
    +-----+------+----+----------------------------------------------------------------------------+
    \endcode
*/